__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 480, 640, 4)  0                                            
__________________________________________________________________________________________________
conv_1 (Conv2D)                 (None, 480, 640, 16) 1616        input_1[0][0]                    
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 480, 640, 16) 0           conv_1[0][0]                     
__________________________________________________________________________________________________
MP_1 (MaxPooling2D)             (None, 240, 640, 16) 0           re_lu[0][0]                      
__________________________________________________________________________________________________
conv_2 (Conv2D)                 (None, 240, 640, 32) 4640        MP_1[0][0]                       
__________________________________________________________________________________________________
batch_normalization_v1 (BatchNo (None, 240, 640, 32) 128         conv_2[0][0]                     
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 240, 640, 32) 0           batch_normalization_v1[0][0]     
__________________________________________________________________________________________________
MP_2 (MaxPooling2D)             (None, 120, 320, 32) 0           re_lu_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 120, 320, 32) 0           MP_2[0][0]                       
__________________________________________________________________________________________________
conv_3 (Conv2D)                 (None, 120, 320, 64) 18496       dropout[0][0]                    
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 120, 320, 64) 0           conv_3[0][0]                     
__________________________________________________________________________________________________
MP_3 (MaxPooling2D)             (None, 60, 160, 64)  0           re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv_4 (Conv2D)                 (None, 60, 160, 64)  36928       MP_3[0][0]                       
__________________________________________________________________________________________________
batch_normalization_v1_1 (Batch (None, 60, 160, 64)  256         conv_4[0][0]                     
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 60, 160, 64)  0           batch_normalization_v1_1[0][0]   
__________________________________________________________________________________________________
MP_4 (MaxPooling2D)             (None, 30, 80, 64)   0           re_lu_3[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 30, 80, 64)   0           MP_4[0][0]                       
__________________________________________________________________________________________________
conv_5 (Conv2D)                 (None, 30, 80, 128)  73856       dropout_1[0][0]                  
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 30, 80, 128)  0           conv_5[0][0]                     
__________________________________________________________________________________________________
MP_5 (MaxPooling2D)             (None, 15, 40, 128)  0           re_lu_4[0][0]                    
__________________________________________________________________________________________________
conv_6 (Conv2D)                 (None, 15, 40, 256)  295168      MP_5[0][0]                       
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 15, 40, 256)  0           conv_6[0][0]                     
__________________________________________________________________________________________________
conv_7 (Conv2D)                 (None, 15, 40, 256)  65792       re_lu_5[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_2 (Batch (None, 15, 40, 256)  1024        conv_7[0][0]                     
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 15, 40, 256)  0           batch_normalization_v1_2[0][0]   
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 256)          0           re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_v1_3 (Batch (None, 256)          1024        global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 256)          65792       batch_normalization_v1_3[0][0]   
__________________________________________________________________________________________________
batch_normalization_v1_4 (Batch (None, 256)          1024        dense[0][0]                      
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 256)          0           batch_normalization_v1_4[0][0]   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 256)          0           re_lu_7[0][0]                    
__________________________________________________________________________________________________
genre_activation (Dense)        (None, 8)            2056        dropout_2[0][0]                  
__________________________________________________________________________________________________
artist_activation (Dense)       (None, 2205)         566685      dropout_2[0][0]                  
__________________________________________________________________________________________________
year (Dense)                    (None, 1)            257         dropout_2[0][0]                  
__________________________________________________________________________________________________
genre (Activation)              (None, 8)            0           genre_activation[0][0]           
__________________________________________________________________________________________________
artist (Activation)             (None, 2205)         0           artist_activation[0][0]          
==================================================================================================
Total params: 1,134,742
Trainable params: 1,133,014
Non-trainable params: 1,728
__________________________________________________________________________________________________
